import React from "react";

export default function AboutUs() {
  return (
    <div className="AboutUs">
      <div className="about-container-picture">
        <h2>Մեր Մասին</h2>
      </div>
      <ul>
        <li>
          Բարի գալուստ <span>Ալբո</span> սուպերմարկետի առցանց խանութ:
        </li>
        <li>
          Հաշվի առնելով օնլայն գնումների պահանջարկի ավելացման միտումները,
          ժամանակակից կյանքի ռիթմը և տեխնոլոգիաների հնարավորությունները, մեր
          թիմը ստեղծել է հարթակ, որի միջոցով հաճախորդները, խնայելով իրենց
          ժամանակը, հնարավորություն կունենան գնել թարմ, որակյալ մթերք՝ միրգ,
          բանջարեղեն, նպարեղեն և այլ ապրանքներ։ 
        </li>
        <li>
          Կայքը առանձնանում է իր պարզությամբ և հասանելիությամբ։ Գործում է
          եռալեզու տարբերակ, ինտեգրված են առցանց վճարման համակարգեր, ինչպես նաև
          տրված է պատվերի առցանց ձևակերպման և հաստատման հնարավորություն՝ կանխիկ
          վճարման տարբերակով։ Հաճախորդը ինքն է ընտրում առավել հարմար տարբերակը։
        </li>
        <li>
        <span>Ալբո</span> առցանց խանութին կից գործում է արագ և ապահով առաքման
          ծառայություն։ Հաճախորդին առաքվում է միայն ու միայն թարմ, որակյալ,
          էկոլոգիապես մաքուր մթերք։
        </li>
        <li>
          Մեր թիմը շարունակում է բարելավել ծառայությունը, այն հնարավորինս հարմար
          դարձնելով սպառողին։ Մենք միշտ ձեր կողքին ենք և մաղթում ենք հաճելի
          գնումներ։
        </li>
      </ul>
    </div>
  );
}
