import React from 'react'
import { useRef } from 'react'


export default function Login() {

    const logRef = useRef()
    const signRef = useRef()
    const logBoxRef = useRef()
    const signBoxRef = useRef()
    const openModalRef = useRef()
    const closeModalRef = useRef()
    const modalRef = useRef()

    function forRotate(log, sign) {
        logBoxRef.current.style.transform = `perspective(850px) rotateY(${log}deg)`;
        signBoxRef.current.style.transform = `perspective(850px) rotateY(${sign}deg)`;
    }



    // closeModalRef.addEventListener('click' ,() => {
    //     modalRef.close()
    // })

    return (
        <div className='login-container'>
            <div className="login-signin-box">
                <div className="login-signin">
                    <p ref={logRef} onClick={e => {
                        e.target.style = 'border-bottom:4px solid #288435;  font-weight: bold;'
                        signRef.current.style = 'border-bottom:1px solid black;'
                        forRotate(0, 180);

                    }}>Մուտք</p>
                    <p ref={signRef} onClick={e => {
                        e.target.style = 'border-bottom:4px solid #288435;  font-weight: bold;'
                        logRef.current.style = 'border-bottom:1px solid black;  font-weight: normal;'
                        forRotate(180, 360);


                    }}>Գրանցվել</p>
                </div>
                <div className="turning">
                    <div ref={logBoxRef} className="login-box">
                        <input type="email" placeholder='Մուտքագրեք ձեր Էլ․ Հասցեն' />
                        <input type="text" placeholder='Մուտքագրեք ձեր Գաղտնաբառը' />
                        <div className="enter-forgot">
                            <div className="remember">
                                <input type="checkbox" className='radio' />
                                <p>Հիշել ինձ</p>
                            </div>
                            <p>Մոռացե՞լ եք ձեր գաղտնաբառը</p>
                        </div>
                        <button className='enter'>Մուտք</button>
                    </div>
                    <div ref={signBoxRef} className="signin-box">
                        <input type="email" placeholder='Մուտքագրեք ձեր Էլ․ Հասցեն' />
                        <input type="text" placeholder='Մուտքագրեք ձեր Գաղտնաբառը' />
                        <input type="text" placeholder='Հաստատեք ձեր Գաղտնաբառը' />
                        <p>Ձեր անձնական տվյալները կօգտագործվեն այս վեբկայքում ձեր փորձառությունն աջակցելու, ձեր հաշիվ մուտքը կառավարելու և մեր <font onClick={() => { modalRef.current.showModal() }} ref={openModalRef} data-open-modal>քաղաքական գաղտնիության</font> մեջ նկարագրված այլ նպատակների համար:</p>
                        <button className='enter'>Գրանցվել</button>
                    </div>
                </div>
            </div>
            
            <dialog ref={modalRef} data-modal>
            <button onClick={() => {modalRef.current.close()}} ref={closeModalRef} data-close-modal>X</button><br />

                Բարի գալուստ ﬔր գաղտնիության քաղաքականության էջ և cookeis էջ: Այստեղ դուք կարող եք գտնել ձեր տվյալների վերաբերյալ տեղեկություններ, թե ինչպես ենք ﬔնք օգտագործում և պաշտպանում այն, ինչպես նաև տեղեկություններ cookie- ների, դրանց նշանակության, ﬔր ծառայությունների ﬔջ դրա օգտագործման և ձեր տեղեկատվության վերաբերյալ ձեր իրավունքների մասին: Խնդրում ենք ուշադիր կարդալ այս քաղաքականությունը և կարդալ նաև ներառված բոլոր երրորդ անձանց գաղտնիության քաղաքականությունը:

                Ձեր տվյալների կամ գաղտնիության հետ կապված խնդիրների վերաբերյալ ցանկացած այլ տեղեկության համար կարող եք կապվել ﬔզ հետ info@mnatany.am աջակցության էլ. Փոստի հասցեով կամ կարող եք կապվել հաճախորդների սպասարկման բաժնի հետ, եթե ﬔնք առցանց ենք: Կարող եք զանգահարել նաև ﬔզ` +374 98 205 044:

                Տվյալների գրավում և պահում
                Մենք կձեռնարկենք բոլոր ողջաﬕտ նախազգուշական ﬕջոցները` ձեր պատվերի և վճարման մանրամասները ապահով պահելու համար, բայց, եթե ﬔնք անփույթ ենք, ﬔնք չենք կարող պատասխանատվություն կրել ձեր կողﬕց տրամադրված տեղեկատվությանը չթույլատրված մուտքի արդյունքում առաջացած կորուստների համար:

                Մենք նաև պահպանում ենք այնպիսի անձնական տվյալներ, ինչպիսիք են էլփոստի հասցեները, անունը և ազգանունը, հեռախոսի համարը և անձնական տվյալների այլ ձևեր, որոնք դուք տրամադրել եք ﬔզ վեբ կայքի ﬕջոցով կամ ﬔր հաճախորդների աջակցության ուղիներով:

                Մենք պահպանում ենք բոլոր գրառուﬓերը, պատվերները և տվյալները հնարավորինս անվտանգ ﬔր վերահսկողության տակ:

                Ձեր տվյալները, տվյալների մշակումը և երրորդ կողﬔրը:

                Այս գաղտնիության քաղաքականությունում «տվյալները», որոնց ﬔնք վերաբերում ենք, նշանակում են թվային տվյալների կամ տեղեկատվության ցանկացած մաս (տվյալների հավաքածու), որը նկարագրում է ձեզ,
                նույնականացնում է ձեզ կամ վերագրվում է ձեզ:

                Մենք հարցում ենք այս տվյալների տարբեր տեսակներ (որոնք կհամարվեն անձնական տվյալներ):

                Mnatany.am- ում ﬔնք խնդրում ենք ﬕայն ձեր էլփոստի հասցեն, օգտագործողի անունը և գաղտնաբառը (խնդրում ենք դիﬔլ երրորդ կողﬕ մուտքի գաղտնիության քաղաքականությանը` «երրորդ կողﬕ կայքեր և
                տվյալների փոխանակում» բաժնում):

                Ձեր գաղտնաբառը կոդավորված է ﬔր տվյալների բազայում, այնպես որ նույնիսկ ﬔնք չենք կարող տեսնել, թե ինչ գաղտնաբառ եք օգտագործում: Եթե մոռացե՞լ եք ձեր գաղտնաբառը կամ կարծում եք, որ այն ﬖասվել է, խնդրում ենք վերափոխեք ձեր գաղտնաբառը:

                Տվյալների այլ տեսակներ ներառում են.
                • Անունը, տարիքը կամ կապի մանրամասները, որոնք մուտքագրվել են մրցույթների, առաջխաղացուﬓերի կամ հարցուﬓերի ընթացքում, որոնք ﬔնք կարող ենք տեղադրել.
                • Հասցեները վճարման կամ առաքման համար
                • Պատվերի պատմություն
                • Ցանկացած տվյալներ կամ տեղեկատվություն, ինչպիսիք են խոսակցությունները կամ խնդրանքները, որոնք ﬔզ ուղարկվել են ﬔր էլ.փոստերում կամ ﬔր տեխնիկական կամ հաճախորդների աջակցման թիﬔրին.
                • Ցանկացած տվյալներ կամ տեղեկատվություն, որը տրված է ﬔր սեփական ֆորուﬓերում

                Եթե ցանկանում եք, որ ﬔնք ջնջենք ձեր տվյալները ﬔր գրառուﬓերից, կարող եք կապվել ﬔզ հետ info@mnatany.am աջակցության էլ. Փոստի հասցեով կամ կարող եք կապվել հաճախորդների սպասարկման բաժնի հետ, եթե ﬔնք առցանց ենք:

                Կարող եք զանգահարել նաև ﬔզ` +374 98 205 044:

                Տվյալների օգտագործում
                Մենք իրավունք ենք վերապահում օգտագործել ձեր տվյալները հետևյալ նպատակներով` ներառյալ, բայց ոչ սահմանափակվելով ﬕայն.
                • Շուկայավարում և առաջխաղացում, ներառյալ լրատուներ, գովազդ, SMS կամ սոցիալական լրատվաﬕջոցների հաղորդագրություններ և այլն
                • Օժանդակել իրավապահներին, ոստիկանության կամ ﬕջազգային գործակալություններին` հակաիրավական նպատակներով
                • Կառավարել ձեր հաշիվը և հնարավորություն ընձեռել հաղորդակցվել ﬔր աջակցության թիﬕ կամ վարորդների հետ
                • Բարձրացնել արդյունավետությունը կայքի կամ ﬔր ծառայությունների օգտագործման համար
                • Օգնել վճարուﬓերի, փոխհատուցման կամ վերադարձման գործընթացին
                • Գործընկերները կամ գործակալները օգտագործում են իրենց խթանման կամ մարքեթինգային արշաﬖերի համար կայքի և դրա ծառայությունների համար
                • Երրորդ կողﬕ գովազդատուները, որոնք օգտագործվում են նպատակային գովազդի համար Հետևելու տեխնոլոգիա և cookies

                Մենք կարող ենք օգտագործել cookies և հետևելու այլ ծրագրեր` կայքի և ﬔր արտադրանքի օգտագործումը հետևելու համար: Սա ներառում է թե որ էջերն եք այցելում, որքան ժամանակ եք ﬓում էջում, ինչ ռեսուրսներ եք օգտագործում կայքում և ձեր ընդհանուր դիտման օրինակը: Մենք դա անում ենք, որպեսզի կարողանանք ավելի լավ կայք ստեղծել ձեր փորձի շուրջ, ինչպես նաև հնարավորություն ունենալ հետագայում հարմարեցնել կայքերի փորձը ձեզ համար:
            </dialog>
        </div>
    )
}
