import React from "react";

export default function PrivicyPage() {
  return (
    <div className="Pricicy">
      <div className="about-container-picture">
        <h2>Գաղտնիություն</h2>
      </div>
      <p>
        Բարի գալուստ ﬔր գաղտնիության քաղաքականության էջ և cookeis էջ: Այստեղ
        դուք կարող եք գտնել ձեր տվյալների վերաբերյալ տեղեկություններ, թե ինչպես
        ենք ﬔնք օգտագործում և պաշտպանում այն, ինչպես նաև տեղեկություններ cookie-
        ների, դրանց նշանակության, ﬔր ծառայությունների ﬔջ դրա օգտագործման և ձեր
        տեղեկատվության վերաբերյալ ձեր իրավունքների մասին: Խնդրում ենք ուշադիր
        կարդալ այս քաղաքականությունը և կարդալ նաև ներառված բոլոր երրորդ անձանց
        գաղտնիության քաղաքականությունը:
      </p>
      <p>
        Ձեր տվյալների կամ գաղտնիության հետ կապված խնդիրների վերաբերյալ ցանկացած
        այլ տեղեկության համար կարող եք կապվել ﬔզ հետ{" "}
        <a href="#">info@albo.am</a> աջակցության էլ. Փոստի հասցեով կամ կարող եք
        կապվել հաճախորդների սպասարկման բաժնի հետ, եթե ﬔնք առցանց ենք: Կարող եք
        զանգահարել նաև ﬔզ` <a href="#">+374 98 888 888</a>:
      </p>
      <span>Տվյալների գրավում և պահում</span>
      <p>
        Մենք կձեռնարկենք բոլոր ողջաﬕտ նախազգուշական ﬕջոցները` ձեր պատվերի և
        վճարման մանրամասները ապահով պահելու համար, բայց, եթե ﬔնք անփույթ ենք,
        ﬔնք չենք կարող պատասխանատվություն կրել ձեր կողﬕց տրամադրված
        տեղեկատվությանը չթույլատրված մուտքի արդյունքում առաջացած կորուստների
        համար:
      </p>
      <p>
        Մենք նաև պահպանում ենք այնպիսի անձնական տվյալներ, ինչպիսիք են էլփոստի
        հասցեները, անունը և ազգանունը, հեռախոսի համարը և անձնական տվյալների այլ
        ձևեր, որոնք դուք տրամադրել եք ﬔզ վեբ կայքի ﬕջոցով կամ ﬔր հաճախորդների
        աջակցության ուղիներով:
      </p>
      <p>
        Մենք պահպանում ենք բոլոր գրառուﬓերը, պատվերները և տվյալները հնարավորինս
        անվտանգ ﬔր վերահսկողության տակ:
      </p>
      <p>Ձեր տվյալները, տվյալների մշակումը և երրորդ կողﬔրը:</p>
      <p>
        Այս գաղտնիության քաղաքականությունում «տվյալները», որոնց ﬔնք վերաբերում
        ենք, նշանակում են թվային տվյալների կամ տեղեկատվության ցանկացած մաս
        (տվյալների հավաքածու), որը նկարագրում է ձեզ, նույնականացնում է ձեզ կամ
        վերագրվում է ձեզ:
      </p>
      <p>
        Մենք հարցում ենք այս տվյալների տարբեր տեսակներ (որոնք կհամարվեն անձնական
        տվյալներ):
      </p>
      <p>
        <a href="#">Albo.am</a>- ում ﬔնք խնդրում ենք ﬕայն ձեր էլփոստի հասցեն,
        օգտագործողի անունը և գաղտնաբառը (խնդրում ենք դիﬔլ երրորդ կողﬕ մուտքի
        գաղտնիության քաղաքականությանը` «երրորդ կողﬕ կայքեր և տվյալների
        փոխանակում» բաժնում):
      </p>
      <p>
        Ձեր գաղտնաբառը կոդավորված է ﬔր տվյալների բազայում, այնպես որ նույնիսկ
        ﬔնք չենք կարող տեսնել, թե ինչ գաղտնաբառ եք օգտագործում: Եթե մոռացե՞լ եք
        ձեր գաղտնաբառը կամ կարծում եք, որ այն ﬖասվել է, խնդրում ենք վերափոխեք
        ձեր գաղտնաբառը:
      </p>
      <p>
        Տվյալների այլ տեսակներ ներառում են.
        <ul>
          <li>
            • Անունը, տարիքը կամ կապի մանրամասները, որոնք մուտքագրվել են
            մրցույթների, առաջխաղացուﬓերի կամ հարցուﬓերի ընթացքում, որոնք ﬔնք
            կարող ենք տեղադրել.
          </li>
          <li>• Հասցեները վճարման կամ առաքման համար</li>
          <li>• Պատվերի պատմություն</li>
          <li>
            • Ցանկացած տվյալներ կամ տեղեկատվություն, ինչպիսիք են
            խոսակցությունները կամ խնդրանքները, որոնք ﬔզ ուղարկվել են ﬔր
            էլ.փոստերում կամ ﬔր տեխնիկական կամ հաճախորդների աջակցման թիﬔրին.
          </li>
          <li>
            • Ցանկացած տվյալներ կամ տեղեկատվություն, որը տրված է ﬔր սեփական
            ֆորուﬓերում
          </li>
        </ul>
      </p>
      <p>
        Եթե ցանկանում եք, որ ﬔնք ջնջենք ձեր տվյալները ﬔր գրառուﬓերից, կարող եք
        կապվել ﬔզ հետ <a href="#">info@albo.am</a> աջակցության էլ. Փոստի հասցեով
        կամ կարող եք կապվել հաճախորդների սպասարկման բաժնի հետ, եթե ﬔնք առցանց
        ենք:
      </p>
      <p>
        Կարող եք զանգահարել նաև ﬔզ` <a href="#">+374 98 888 888</a>
      </p>
      <span>Տվյալների օգտագործում</span>
      <p>
        Մենք իրավունք ենք վերապահում օգտագործել ձեր տվյալները հետևյալ
        նպատակներով` ներառյալ, բայց ոչ սահմանափակվելով ﬕայն.
        <ul>
          <li>
            • Շուկայավարում և առաջխաղացում, ներառյալ լրատուներ, գովազդ, SMS կամ
            սոցիալական լրատվաﬕջոցների հաղորդագրություններ և այլն
          </li>
          <li>
            • Օժանդակել իրավապահներին, ոստիկանության կամ ﬕջազգային
            գործակալություններին` հակաիրավական նպատակներով
          </li>
          <li>
            • Կառավարել ձեր հաշիվը և հնարավորություն ընձեռել հաղորդակցվել ﬔր
            աջակցության թիﬕ կամ վարորդների հետ
          </li>
          <li>
            • Բարձրացնել արդյունավետությունը կայքի կամ ﬔր ծառայությունների
            օգտագործման համար
          </li>
          <li>• Օգնել վճարուﬓերի, փոխհատուցման կամ վերադարձման գործընթացին</li>
          <li>
            • Գործընկերները կամ գործակալները օգտագործում են իրենց խթանման կամ
            մարքեթինգային արշաﬖերի համար կայքի և դրա ծառայությունների
            համարԵրրորդ կողﬕ գովազդատուները, որոնք օգտագործվում են նպատակային
            գովազդի համար Հետևելու տեխնոլոգիա և cookies
          </li>
        </ul>
      </p>

      <p>
        Մենք կարող ենք օգտագործել cookies և հետևելու այլ ծրագրեր` կայքի և ﬔր
        արտադրանքի օգտագործումը հետևելու համար: Սա ներառում է թե որ էջերն եք
        այցելում, որքան ժամանակ եք ﬓում էջում, ինչ ռեսուրսներ եք օգտագործում
        կայքում և ձեր ընդհանուր դիտման օրինակը: Մենք դա անում ենք, որպեսզի
        կարողանանք ավելի լավ կայք ստեղծել ձեր փորձի շուրջ, ինչպես նաև
        հնարավորություն ունենալ հետագայում հարմարեցնել կայքերի փորձը ձեզ համար:
      </p>
      <p>
        Մենք օգտագործում ենք ձեր տվյալները` անհատական խաղային փորձ ձեռք բերելու
        համար` ձեր տարիքի, գտնվելու վայրի, նախասիրությունների և այլնի համար: Սա
        նաև ներառում է ձեր տվյալների, ինչպիսիք են էլ.փոստը կամ հեռախոսահամարը
        օգտագործելը` ձեզ հետ կապ հաստատելու համար խնդիրների կամ գովազդային կամ
        նորությունների հետ կապված նպատակների համար:
      </p>
      <p>
        Մենք նաև օգտագործում ենք ձեր տվյալները` համոզվելու համար, որ դուք
        հետևում եք ﬔր ծառայությունների մատուցման պայմաններին , որ դուք
        պաշտպանված եք որպես ﬔր ծառայությունների օգտագործող սահմանափակելով
        ﬖասակար վարքագիծը և հնարավոր է` պատճառելով կորուստներ կամ ﬖասներ ﬔր
        պայմաններն ու պայմանները խախտելու հետևանքով կամ դադարեցնելու օրենքների
        կամ կանոնակարգերի խախտումը երկրում, դուք օգտագործում եք ﬔր
        ծառայությունները:
      </p>
      <p>
        Ձեզ հակերներից, վիրուսներից կամ ﬖասակար իրադարձություններից կամ
        վրիպակներից պաշտպանելու ունակությունը նույնպես կախված է ﬔր կողﬕց գրանցած
        տվյալների և ﬔր ծառայություններից օգտվելու փորձից օգտվելու ﬔր ունակության
        վրա:
      </p>
      <p>
        Մուտք գործելու հնարավորության համար ﬔնք օգտագործում ենք նաև երրորդ կողﬕ
        հաճախորդների, ինչպիսիք են Facebook- ը և Google- ը: Սա հայտնի է որպես
        կապող սոցիալական լրատվաﬕջոցների հաշիﬖեր: Մենք նաև օգտագործում ենք ձեր
        տվյալները գովազդային ընկերություններին տրամադրված անհատականացված
        գովազդների համար, ինչպիսիք են Google AdSense- ը: Լրացուցիչ
        տեղեկությունների համար կարող եք դիﬔլ Google AdSense- ի քաղաքականությանը
        և պայմաններին`{" "}
        <a href="https://www.google.com/adsense/new/localizedterms?gsessionid=zCqSzSc8KFvc5hMACvseZJC1Fwq5-rVZ">
          Այստեղ
        </a>
        : Կարող եք անջատել նպատակային գովազդը, սակայն ﬔնք դեռ կցուցադրենք
        գովազդը վեբ կայքում:
      </p>
      <span>Cookie- ի քաղաքականություն</span>
      <p>
        Ի՞նչ է Cookie: Դե, cookie- ն այն տեղեկությունն է, որը ցանցով կայքից
        ուղարկվում է ձեր համակարգիչ: Այս տվյալները պահվում են ձեր տեղական
        բրաուզերում: Դրանք պարզապես պարզ տեքստային ֆայլեր են:
      </p>
      <p>
        Ինչ՞ու ենք օգտագործում cookie-ներ: Պարզապես ձեր բրաուզերում օգտակար
        տեղեկությունները պահելու կամ ձեր գործողությունները գրանցելու` ﬔր
        ծառայությունները կամ ձեր բրաուզերը օգտագործելուց:
      </p>
      <p>
        Դրանք վատն՞ են: Դե, ﬔր cookie-ներ ﬖասակար չեն ձեր համակարգչի համար, բայց
        շատերը կարծում են, որ դրանք անվտանգության առումով ﬖասակար են: Ձեր
        որոնուﬓերը, գործողությունները ձեր բրաուզերում գրանցվում և հասանելի են ﬔզ
        կամ այլ կազմակերպությունների համար, ինչպիսիք են երրորդ կողﬕ
        գովազդատուները:
      </p>
      <p>
        Մենք օգտագործում ենք cookie-ներ երրորդ կողﬕ գովազդատուների համար,
        որպեսզի կարողանանք իրականացնել թիրախավորված գովազդներ` նկատի ունենալով
        այն գովազդը ցույց տալը, որն ավելի պիտանի է ինտերնետում, որի համար
        սովորաբար փնտրում եք, կամ ցանկանում եք զննել: Կարող եք անջատել
        նպատակային գովազդը ձեր պարաﬔտրերում, այնուաﬔնայնիվ ﬔնք դեռ ցույց կտանք
        գովազդը (չնայած նպատակային չէ):
      </p>
      <p>
        Այս երրորդ կողﬕ գովազդատուները, ինչպիսիք են Google- ը, օգտագործում են
        cookie-ները գործընկեր կայքերում: Այս երրորդ կողﬕ գովազդատուներն
        այնուհետև օգտագործում են այս cookie-ները` գովազդները ձեզ ներկայացնելու
        համար:
      </p>

      <p>
        Դուք կարող եք հրաժարվել գովազդատուների կողﬕց գովազդներից: Օրինակ` այս
        հղումը քայլ առ քայլ, թե ինչպես դա անել`{" "}
        <a href="https://support.google.com/ads/answer/2662922?hl=en">
          կարող եք նայել այստեղ{" "}
        </a>
        :
      </p>
      <p>
        Միշտ կարող եք մաքրել ձեր cookie-ները, բայց տարբեր ձև յուրաքանչյուր
        բրաուզերի համար: Հիշեք, որ դուք սովորաբար մաքրում եք քեշը և cookie-ները`
        նկատի ունենալով այլ տեղական ֆայլեր կամ պատկերներ, որոնք պահվում են
        (պահված են) ձեր տեղական համակարգում` բեռնման կայքերը ավելի արագ
        կատարելու համար: Մի ջնջեք պահպանված գաղտնաբառերը:
      </p>
      <p>
        Մեր գովազդային վաճառողների մասին լրացուցիչ տեղեկություններ ստանալու
        համար կարող եք անցնել հղումով Google AdSense- ում`{" "}
        <a href="https://www.google.com/adsense/start/">այստեղ</a>
        Կամ տեսեք, թե ինչպես է Google- ը օգտագործում cookie- ներ 
        <a href="https://policies.google.com/technologies/cookies">
        այստեղ
        </a>
      </p>
    </div>
  );
}
